#print("Оператор break та continue")
#break - перериває роботу циклу
#continue - повертає цикл до перевірки умови, тобто робить повтор
#школа - підрахувати скільки учнів є в школі
#вік учнів
#age = int(input('введіть вік учнів '))

count = 0
k=int(input('введіть кількість учнів в школі '))
pupil=1
while pupil <=k:# цткл while повтоюватиметься введену кількість раз k
    age = int(input(f'введіть вік учня {pupil} '))
    if age>=6 and age < 18:# зазначаємо вік дітей, які є учнями школи
        pupil+=1
        count += 1
        print(f"Дитині {pupil} зараз {age} до повноліття лишилося ", 18-age)
    else:
        print("Програма стикнулася із помилкою! Це не учень школи")
        continue
                    
print("Спискова кількість учнів школи ", count)


