# Функція приймає 2 параметри
# 1 - параметр кількість разів 
# 2 - параметр текст для виведення
# коли виводимо на екран має бути формат виводу 
# 1 - ТЕКСТ
# 2 - ТЕКСТ
# n - ТЕКСТ
# якщо 1 параметр < 0 нічого не робити
def myViewSalo(countTry, mytext):
   # countTry = 3 #Кількість спроб 
   # mytext = "сало" 

    i = 0 # лічильник циклу
    while (i<countTry):
        print(f"{i+1} - {mytext}") #F "" рядок у який підставляється зміння
        i+=1

count = input(" Вкажіть текст -->_ ")
text = input('Вкажіть повідомлення -> _')
#myViewSalo(2, "Слава Україні")  
myViewSalo(int(count), text)