#print("Привіт усім!")

# Функція - це іменовий блок коду, який виконує певне завдання.
# Функції допомогають уникати проблеми дублювання коду,
# роблячи код більш організованим і легким для читання.
# Ми можемо оголосити функцію і описати її поведінку.
# Потім викликати її довільку кількість разів у будь-якому місці нашого коду.

# прототип оголшення функції
# def назва_функції():
#     блок_коду_функції

# def - ключове слово для оголошення функції
# назва_функції - ім'я, яке ми даємо нашій функції - 
# не може починатися з цифри, не може містити пробілів, 
# не може бути зарезервованим словом
# Зарезервовані слова - if, else, for, while, def, return
# print - це також зарезервоване слово - це назва вбудованої функції 
#
# Фунція особлива тим, що вана у кінці слова має дужки ()
# У кінці оголошення функції стоїть двокрапка :
# Тіло функції (блок коду функції) - що функція буде виконувати
# має бути відступлено на 4 пробіли або один табулятор
# перед створенням функції визначаємо, що вона має робити
#
#
def greetValentines():
    print('--Вітаю з Днем Закоханих--!')
    print('++ Шукай мполовинку серця++!')
# Як викликати функцію 
greetValentines() #викликаю код функцію в даному місці
#Скільки разів викликати функцію
count=input(" Скільки разів Вас привітати  з Днем Закоханих -->? ")
intCount = int (count)
i=0 # лічильник циклу - кожна ітерація збільшеється на 1 
while i < intCount:
    greetValentines() #Виклик функції
    i+=1 # збільшуемо лічильник на 1