# Створюю функію 
def myPrint(): # дана функція без параметрів
    print(' Це моя функція')
# викликає мо функію
myPrint()
#Параметри - це вхідні дані для функії
# Особливості мвикористання функціїї 
# В залажності від задачі функція приймає 1 аба більше ипараметів
# для побудови функції з параметрами необхідно вказати назвти параметрів
# необхідно вказати вхідний параметр (або змінну)
# Змінна text  - це формальний параметр функції, який може використовуватися у середині функції 

def myHellowfrend(text):
    print("---"+text+"---")
    # В даному випадку text = Салют команда
myHellowfrend('Салют команда : )') # Конкатонатонація рядків - обєднання ( склеювання)

name = input (' Як Вас звати -->? ')
myHellowfrend(name) # Конкатонатонація рядків - обєднання ( склеювання)
